# Сумма трёх чисел
# Напишите программу, которая считывает три целых числа и выводит на
# экран их сумму. Каждое число записано в отдельной строке.
# Ввод:
# 1
# 2
# 3
# Вывод:
# 6

# Решение:

# Считываем три целых числа с новой строки каждое
a = int(input())
b = int(input())
c = int(input())
print(a + b + c)
